In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

sns.set()

In [2]:
data_latih = pd.read_csv('https://raw.githubusercontent.com/imdwipayana/Titanic-Data-Analysis/main/train.csv')
data_uji = pd.read_csv('https://raw.githubusercontent.com/imdwipayana/Titanic-Data-Analysis/main/test.csv')

In [3]:
data_latih.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
data_uji.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [10]:
data_latih.shape

(183, 12)

In [11]:
data_uji.shape

(418, 11)

In [5]:
data_latih.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [7]:
data_uji.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [8]:
data_latih = data_latih.dropna()

In [12]:
data_latih.shape

(183, 12)

In [9]:
data_latih.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [13]:
data_uji = data_uji.dropna()

In [14]:
data_uji.shape

(87, 11)

In [15]:
data_latih.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [16]:
data_latih.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S

In [17]:
data_uji.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
12,904,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
14,906,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S
24,916,1,"Ryerson, Mrs. Arthur Larned (Emily Maria Borie)",female,48.0,1,3,PC 17608,262.3750,B57 B59 B63 B66,C
26,918,1,"Ostby, Miss. Helene Ragnhild",female,22.0,0,1,113509,61.9792,B36,C
28,920,1,"Brady, Mr. John Bertram",male,41.0,0,0,113054,30.5000,A21,S

In [18]:
data_latih = data_latih.drop(['Name', 'Sex','Ticket','Cabin','Embarked'], axis=1)
data_uji = data_uji.drop(['Name', 'Sex','Ticket','Cabin','Embarked'], axis=1)
data_latih = data_latih.drop(['PassengerId'],axis=1)

In [19]:
data_latih.head()

    Survived  Pclass   Age  SibSp  Parch     Fare
1          1       1  38.0      1      0  71.2833
3          1       1  35.0      1      0  53.1000
6          0       1  54.0      0      0  51.8625
10         1       3   4.0      1      1  16.7000
11         1       1  58.0      0      0  26.5500

In [20]:
data_uji.head()

    PassengerId  Pclass   Age  SibSp  Parch      Fare
12          904       1  23.0      1      0   82.2667
14          906       1  47.0      1      0   61.1750
24          916       1  48.0      1      3  262.3750
26          918       1  22.0      0      1   61.9792
28          920       1  41.0      0      0   30.5000

In [21]:
data_fix_dilatih = data_latih.drop('Survived', axis=1)
target = data_latih['Survived']

In [22]:
from sklearn.svm import SVC

In [23]:
from sklearn.model_selection import KFold
from sklearn.model_selection import cross_val_score
k_fold = KFold(n_splits=10, shuffle=True, random_state=0)

In [24]:
model = SVC()
score = cross_val_score(model,data_fix_dilatih,target,cv=k_fold,n_jobs=1,scoring='accuracy')
print(score)

[0.78947368 0.84210526 0.63157895 0.61111111 0.83333333 0.61111111
 0.38888889 0.66666667 0.55555556 0.77777778]

In [25]:
score.mean()*100

67.07602339181287